SunCity/src/Catalogs/СкидкиНаценки/СкидкиНаценки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СкидкиНаценки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВалютаПредоставления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантСовместногоПрименения</name>
    <type>
      <types>EnumRef.ВариантыСовместногоПримененияСкидокНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеСкидкиНаценки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбластьПредоставления</name>
    <type>
      <types>EnumRef.ВариантыОбластейОграниченияСкидокНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СегментНоменклатурыПредоставления</name>
    <type>
      <types>CatalogRef.СегментыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПредоставления</name>
    <type>
      <types>EnumRef.СпособыПредоставленияСкидокНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДействия</name>
    <type>
      <types>EnumRef.СтатусыДействияСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>Управляемая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодарокИзСписка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодарокИзКорзиныПокупателя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПодарковИзКорзиныПокупателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПодарокКакПродажу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МоментВыдачиСообщения</name>
    <type>
      <types>EnumRef.ТочкиВыдачиСообщенияКассиру</types>
    </type>
  </attributes>
  <attributes>
    <name>БонуснаяПрограммаЛояльности</name>
    <type>
      <types>CatalogRef.БонусныеПрограммыЛояльности</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодДействия</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодовДействия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОтсрочкиНачалаДействия</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодовОтсрочкиНачалаДействия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратноКоличествуУсловий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграничениеРазмераПодчиненныхСкидок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешняяОбработка</name>
    <type>
      <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыВнешнейОбработки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УсловияПредоставления</name>
    <attributes>
      <name>УсловиеПредоставления</name>
      <type>
        <types>CatalogRef.УсловияПредоставленияСкидокНаценок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЦеновыеГруппы</name>
    <attributes>
      <name>ЦеноваяГруппа</name>
      <type>
        <types>CatalogRef.ЦеновыеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСкидкиНаценки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборПодарков</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SunCity/src/Enums/ВариантыСовместногоПримененияСкидокНаценок/ВариантыСовместногоПримененияСкидокНаценок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыСовместногоПримененияСкидокНаценок</name>
  <enumValues>
    <name>Вытеснение</name>
  </enumValues>
  <enumValues>
    <name>Минимум</name>
  </enumValues>
  <enumValues>
    <name>Максимум</name>
  </enumValues>
  <enumValues>
    <name>Сложение</name>
  </enumValues>
  <enumValues>
    <name>ПоследовательноеПрименение</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Catalogs/СкидкиНаценки/Forms/ФормаГруппы/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// Обработчик подсистемы запрета редактирования реквизитов объектов.
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
	
	Если Параметры.Ключ = Неопределено Или Параметры.Ключ.Пустая() Тогда
		
		Объект.ВариантСовместногоПрименения = Перечисления.ВариантыСовместногоПримененияСкидокНаценок.Максимум;
		Объект.Наименование = Строка(Объект.ВариантСовместногоПрименения);
		
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.ПустаяСсылка();
	КонецЕсли;
	
	Элементы.ГруппаПараметрыОграничения.Доступность = Объект.ОграничениеРазмераПодчиненныхСкидок;
	Элементы.СпособПредоставления.АвтоОтметкаНезаполненного = Объект.ОграничениеРазмераПодчиненныхСкидок;
	Элементы.ЗначениеСкидкиНаценки.АвтоОтметкаНезаполненного = Объект.ОграничениеРазмераПодчиненныхСкидок;
	
	Если НЕ Объект.ОграничениеРазмераПодчиненныхСкидок Тогда
		Объект.ЗначениеСкидкиНаценки = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Обработчик подсистемы запрета редактирования реквизитов объектов.
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    
    // &ЗамерПроизводительности
    ОценкаПроизводительностиРТКлиент.НачатьЗамер(
		     Истина, "Справочник.СкидкиНаценки.Форма.ФормаГруппы.Открытие");

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОграничениеРазмераПодчиненныхСкидокПриИзменении(Элемент)
	
	Элементы.ГруппаПараметрыОграничения.Доступность = Объект.ОграничениеРазмераПодчиненныхСкидок;
	Элементы.СпособПредоставления.АвтоОтметкаНезаполненного = Объект.ОграничениеРазмераПодчиненныхСкидок;
	Элементы.ЗначениеСкидкиНаценки.АвтоОтметкаНезаполненного = Объект.ОграничениеРазмераПодчиненныхСкидок;
	Если НЕ Объект.ОграничениеРазмераПодчиненныхСкидок Тогда
		Объект.СпособПредоставления = Неопределено;
		Объект.ЗначениеСкидкиНаценки = 0;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	
	ЗапретРедактированияРеквизитовОбъектовКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантСовместногоПримененияСкидокНаценокПриИзменении(Элемент)
	
	Если ПустаяСтрока(Объект.Наименование) Тогда
		Объект.Наименование = Строка(Объект.ВариантСовместногоПрименения);
	Иначе
		Для Каждого ЭлементСписка Из Элементы.ВариантСовместногоПримененияСкидокНаценок.СписокВыбора Цикл
			Если Строка(ЭлементСписка.Значение) = Объект.Наименование Тогда
				Объект.Наименование = Строка(Объект.ВариантСовместногоПрименения);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
